#
# Copyright (C) 2021-2022 by TeamYukki@Github, < https://github.com/TeamYukki >.
#
# This file is part of < https://github.com/TeamYukki/YukkiMusicBot > project,
# and is released under the "GNU v3.0 License Agreement".
# Please see < https://github.com/TeamYukki/YukkiMusicBot/blob/master/LICENSE >
#
# All rights reserved.

HELP_1 = """
    ❡━━━❂ اوامـــر الميـــوزك ❂━━━❡

✅<b><u>اوامر الادمن:</u></b> 

𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓
• إليك اوامر التحكم بالمقاطع المشغله ( دآخل المجموعات )  •
• الاوامر تعمل بدون استخدام اي علامات  •
𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓

◍ -『 وقف 』\n لإيقاف المقطع مؤقتآ داخل المحادثه الصوتيه  •
◍ -『 كمل 』\n لاستئناف المقطع مره اخري داخل المحادثه الصوتيه  •
◍ -『 اسكت 』\n لكتم صوت المقطع داخل المحادثه الصوتيه  •
◍ -『 اتكلم 』\n لألغاء كتم صوت المقطع داخل المحادثه الصوتيه  •
◍ -『 تخطي او التالي 』\n للتخطي إلي المقطع المنتظر بقائمة الانتظار لديك  •
◍ -『 ايقاف او انهاء 』\n لأنهاء التشغيل ومغادره المساعد المحادثه الصوتيه  •
𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓
• إليك اوامر التحكم بالمقاطع المشغله ( دآخل القنوات )  •
◍  قريبا سيتم اضافة التشغيل في القنوات  . 
• الاوامر تعمل بدون استخدام اي علامات  •
𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓
     ❡━━━━❂اوامـــر الميـــوزك ❂━━ ❡"""


HELP_2 = """
     ❡━━━ ❂ اوامـــر الميـــوزك ❂━━❡

✅<b><u>اوامرالتشغيل :</u></b> 

• اوامر تشغيل البوت في الجروبات والقنوات  •
• الاوامر تعمل بدون استخدام اي علامات  •
𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓
◍ - اوامر تشغيل البوت في المجموعات 

◍ -『 دينا شغلي او شغل  』\n ثم اسم المقطع الصوتي او الرابط الخاص به  •
◍ -『 شغل او دينا شغلي 』\n ثم اسم مقطع الفيديو او الرابط الخاص به  •
◍ -『 بحث او تنزيل 』\n ثم اسم المقطع المراد تنزيله من موقع اليوتيوب مباشر او الرابط الخاص به  •
◍ -『 ريلود 』\n قم بأرسالها ( دآخل المجموعات ) لتحديث قائمه المشرفين بمجموعتك  •
𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓
     ❡━━━ ❂ اوامـــر الميـــوزك ❂━━━❡"""


HELP_3 = """
     ❡━━━❂ اوامـــر الميـــوزك ❂━━━❡

✅<u>اوامر البوت:</u>

𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓
• إليك قسم ( الاوامر الاضافيه ) للبوت  •
• جميع الاوامر تعمل بدون علامات  •
𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓

◍ -『 حدد 』\n ثم رقم المجموعات الذي تستخدم بوتك فيديو بنفس الوقت •

◍ -『 وضع شغل 』\n لضبط وضع تحكم التشغيل للأدمن او للاعضاء داخل مجموعتك  •

◍ -『 القائمه 』\n لعرض قائمه التشغيل الخاصه بك  •

◍ -『 حذف القائمه 』\n لحذف قائمه التشغيل الخاصه بك  •

◍ -『 لغه 』\n لتغيير لغة البوت إلي اي لغه اخري  •

◍ -『 احصائيات 』\n لعرض قسم الاحصائيات العامه للبوت ولترند التشغيل العالمي •

◍ -『 ريلود 』\n لتحديث قائمة المشرفين داخل مجموعتك •

◍ -『 بينج 』\n لقياس سرعه التشغيل على السيرفر وعرض تفاصيل معلومات التشغيل •
𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓

     ❡━━━ ❂اوامـــر الميـــوزك ❂━━ ❡"""

HELP_4 = """ ❡━━━ ❂ اوامـــر الميـــوزك ❂━━❡

»  اليك قائمة مميزات ✧ [<a href=https://t.me/Mlze1bot> 𝑺𝒐𝒖𝒓𝒄𝒆 𝒅𝒊𝒏𝒂</a>] ✅:
«  ملاحظة  :   تستخدم الامر  بالجروبات 
»  غنيلي   - لاختيار أغنيه عشوائيه لك   
»  شيله  - لـ إرسال شيله عشوائية مميزه لك 
«  زامل - لـ إرسال زامل عشوائي لك 
»  حالات او استوري 
«  اقتباس اواقتباسات     
»  أغنيه او اغاني  - لـ أختيار اغنيه عشوائيه لك 
»  بحث او تنزيل - لتنزيل مقطع في اليوتيوب
«  كت + لو خيروك + نكته 
» العاب  -   لعرض الالعاب الاونلاين الحديثه
    
      ❡━━❂  اوامــر التـرفــيه ❂━━ ❡ """

HELP_5 = """
       <b> حقوق السـورس :</b>
<b> قائمة المسلسلات والأنمي  :</b> 
« لعرض قائمة الأنمي  : 
»  أرسل - <b> انمي </b> 
« لعرض قائمة المسلسلات والأفلام  : 
»  أرسل - <b> مسلسلات او افلام </b> 
◍━ <b> ملاحظة مهمه </b>: 
» الانميات والمسلسلات جاهزات على ازرار اونلاين \n يعني بدون بحت وتنزيل فقط تصفح القائمه \n واختر ما تريد مشاهدة  
"""

HELP_6 = """ ❡━━━━━ ❂ اوامـــر الميـــوزك ❂━━━━━ ❡

/addsudo - اضافة مطور

/delsudo - حذف مطور

/reboot - إعادة تشغيل البوت

/speedtest - سرعة الخادم

/block + معرف الشخص لحظره

/unblock + معرف الشخص لرفع حظره

/blockedusers - المحظورين

/gban + معرف الشخص لحظره عام

/ungban + معرف الشخص لالغاء حظره عام

/gbannedusers - المحظورين عام

/broadcast -user -assistant -pin + 

الرسالة لأذاعتها ⟰

/logger [disable | enable] 

معرفة من يستخدم البوت ⟰

/blacklistchat + معرف القناة او المجموعة 

لحظر جروب  ⟰

/whitelistchat + معرف القناة او المجموعة 

لرفع حظرها ⟰

/blacklistedchat - 

المجموعات والقنوات المحظورة ⟰

❡━━━━━ ❂اوامـــر الميـــوزك ❂━━━━━ ❡
"""

HELP_7 = """
<u><b>ɢʟᴏʙᴀʟ ʙᴀɴ ғᴇᴀᴛᴜʀᴇ</b></u> [ᴏɴʟʏ ғᴏʀ sᴜᴅᴏᴇʀs] :

/gban [ᴜsᴇʀɴᴀᴍᴇ ᴏʀ ʀᴇᴩʟʏ ᴛᴏ ᴀ ᴜsᴇʀ] : ɢʟᴏʙᴀʟʟʏ ʙᴀɴs ᴛʜᴇ ᴄʜᴜᴛɪʏᴀ ғʀᴏᴍ ᴀʟʟ ᴛʜᴇ sᴇʀᴠᴇᴅ ᴄʜᴀᴛs ᴀɴᴅ ʙʟᴀᴄᴋʟɪsᴛ ʜɪᴍ ғʀᴏᴍ ᴜsɪɴɢ ᴛʜᴇ ʙᴏᴛ.
/ungban [ᴜsᴇʀɴᴀᴍᴇ ᴏʀ ʀᴇᴩʟʏ ᴛᴏ ᴀ ᴜsᴇʀ] : ɢʟᴏʙᴀʟʟʏ ᴜɴʙᴀɴs ᴛʜᴇ ɢʟᴏʙᴀʟʟʏ ʙᴀɴɴᴇᴅ ᴜsᴇʀ.
/gbannedusers : sʜᴏᴡs ᴛʜᴇ ʟɪsᴛ ᴏғ ɢʟᴏʙᴀʟʟʏ ʙᴀɴɴᴇᴅ ᴜsᴇʀs.
"""

HELP_8 = """
<b><u>ʟᴏᴏᴘ sᴛʀᴇᴀᴍ :</b></u>

<b>sᴛᴀʀᴛs sᴛʀᴇᴀᴍɪɴɢ ᴛʜᴇ ᴏɴɢᴏɪɴɢ sᴛʀᴇᴀᴍ ɪɴ ʟᴏᴏᴘ</b>

/loop [enable/disable] : ᴇɴᴀʙʟᴇs/ᴅɪsᴀʙʟᴇs ʟᴏᴏᴘ ғᴏʀ ᴛʜᴇ ᴏɴɢᴏɪɴɢ sᴛʀᴇᴀᴍ
/loop [1, 2, 3, ...] : ᴇɴᴀʙʟᴇs ᴛʜᴇ ʟᴏᴏᴘ ғᴏʀ ᴛʜᴇ ɢɪᴠᴇɴ ᴠᴀʟᴜᴇ.
"""

HELP_9 = """
<u><b>ᴍᴀɪɴᴛᴇɴᴀɴᴄᴇ ᴍᴏᴅᴇ</b></u> [ᴏɴʟʏ ғᴏʀ sᴜᴅᴏᴇʀs] :

/logs : ɢᴇᴛ ʟᴏɢs ᴏғ ᴛʜᴇ ʙᴏᴛ.

/logger [ᴇɴᴀʙʟᴇ/ᴅɪsᴀʙʟᴇ] : ʙᴏᴛ ᴡɪʟʟ sᴛᴀʀᴛ ʟᴏɢɢɪɴɢ ᴛʜᴇ ᴀᴄᴛɪᴠɪᴛɪᴇs ʜᴀᴩᴩᴇɴ ᴏɴ ʙᴏᴛ.

/maintenance [ᴇɴᴀʙʟᴇ/ᴅɪsᴀʙʟᴇ] : ᴇɴᴀʙʟᴇ ᴏʀ ᴅɪsᴀʙʟᴇ ᴛʜᴇ ᴍᴀɪɴᴛᴇɴᴀɴᴄᴇ ᴍᴏᴅᴇ ᴏғ ʏᴏᴜʀ ʙᴏᴛ.
"""

HELP_10 = """
<b><u>ᴘɪɴɢ & sᴛᴀᴛs :</b></u>

/start : sᴛᴀʀᴛs ᴛʜᴇ ᴍᴜsɪᴄ ʙᴏᴛ.
/help : ɢᴇᴛ ʜᴇʟᴩ ᴍᴇɴᴜ ᴡɪᴛʜ ᴇxᴩʟᴀɴᴀᴛɪᴏɴ ᴏғ ᴄᴏᴍᴍᴀɴᴅs.

/ping : sʜᴏᴡs ᴛʜᴇ ᴩɪɴɢ ᴀɴᴅ sʏsᴛᴇᴍ sᴛᴀᴛs ᴏғ ᴛʜᴇ ʙᴏᴛ.

/stats : sʜᴏᴡs ᴛʜᴇ ᴏᴠᴇʀᴀʟʟ sᴛᴀᴛs ᴏғ ᴛʜᴇ ʙᴏᴛ.
"""

HELP_11 = """
<u><b>ᴩʟᴀʏ ᴄᴏᴍᴍᴀɴᴅs :</b></u>

<b>v :</b> sᴛᴀɴᴅs ғᴏʀ ᴠɪᴅᴇᴏ ᴩʟᴀʏ.
<b>force :</b> sᴛᴀɴᴅs ғᴏʀ ғᴏʀᴄᴇ ᴩʟᴀʏ.

/play ᴏʀ /vplay : sᴛᴀʀᴛs sᴛʀᴇᴀᴍɪɴɢ ᴛʜᴇ ʀᴇǫᴜᴇsᴛᴇᴅ ᴛʀᴀᴄᴋ ᴏɴ ᴠɪᴅᴇᴏᴄʜᴀᴛ.

/playforce ᴏʀ /vplayforce : sᴛᴏᴩs ᴛʜᴇ ᴏɴɢᴏɪɴɢ sᴛʀᴇᴀᴍ ᴀɴᴅ sᴛᴀʀᴛs sᴛʀᴇᴀᴍɪɴɢ ᴛʜᴇ ʀᴇǫᴜᴇsᴛᴇᴅ ᴛʀᴀᴄᴋ.
"""

HELP_12 = """
<b><u>sʜᴜғғʟᴇ ᴏ̨ᴜᴇᴜᴇ :</b></u>

/shuffle : sʜᴜғғʟᴇ's ᴛʜᴇ ᴏ̨ᴜᴇᴜᴇ.
/queue : sʜᴏᴡs ᴛʜᴇ sʜᴜғғʟᴇᴅ ᴏ̨ᴜᴇᴜᴇ.
"""

HELP_13 = """
<b><u>sᴇᴇᴋ sᴛʀᴇᴀᴍ :</b></u>

/seek [ᴅᴜʀᴀᴛɪᴏɴ ɪɴ sᴇᴄᴏɴᴅs] : sᴇᴇᴋ ᴛʜᴇ sᴛʀᴇᴀᴍ ᴛᴏ ᴛʜᴇ ɢɪᴠᴇɴ ᴅᴜʀᴀᴛɪᴏɴ.
/seekback [ᴅᴜʀᴀᴛɪᴏɴ ɪɴ sᴇᴄᴏɴᴅs] : ʙᴀᴄᴋᴡᴀʀᴅ sᴇᴇᴋ ᴛʜᴇ sᴛʀᴇᴀᴍ ᴛᴏ ᴛʜᴇ ᴛʜᴇ ɢɪᴠᴇɴ ᴅᴜʀᴀᴛɪᴏɴ.
"""

HELP_14 = """
<b><u>sᴏɴɢ ᴅᴏᴡɴʟᴏᴀᴅ</b></u>

/song [sᴏɴɢ ɴᴀᴍᴇ/ʏᴛ ᴜʀʟ] : ᴅᴏᴡɴʟᴏᴀᴅ ᴀɴʏ ᴛʀᴀᴄᴋ ғʀᴏᴍ ʏᴏᴜᴛᴜʙᴇ ɪɴ ᴍᴘ3 ᴏʀ ᴍᴘ4 ғᴏʀᴍᴀᴛs.
"""

HELP_15 = """
<b><u>sᴘᴇᴇᴅ ᴄᴏᴍᴍᴀɴᴅs :</b></u>

ʏᴏᴜ ᴄᴀɴ ᴄᴏɴᴛʀᴏʟ ᴛʜᴇ ᴘʟᴀʏʙᴀᴄᴋ sᴘᴇᴇᴅ ᴏғ ᴛʜᴇ ᴏɴɢᴏɪɴɢ sᴛʀᴇᴀᴍ. [ᴀᴅᴍɪɴs ᴏɴʟʏ]

/speed or /playback : ғᴏʀ ᴀᴅᴊᴜsᴛɪɴɢ ᴛʜᴇ ᴀᴜᴅɪᴏ ᴘʟᴀʏʙᴀᴄᴋ sᴘᴇᴇᴅ ɪɴ ɢʀᴏᴜᴘ.
/cspeed or /cplayback : ғᴏʀ ᴀᴅᴊᴜsᴛɪɴɢ ᴛʜᴇ ᴀᴜᴅɪᴏ ᴘʟᴀʏʙᴀᴄᴋ sᴘᴇᴇᴅ ɪɴ ᴄʜᴀɴɴᴇʟ.
"""
